---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningElectricalDisconnects
source: html/1a5ac6c8-8a2e-0772-652d-7584e465c1d5.htm
---
# Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningElectricalDisconnects Property

Whether or not to show the graphical warnings for Electrical disconnects.

## Syntax (C#)
```csharp
public bool ShowGraphicalWarningElectricalDisconnects { get; set; }
```